In [16]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd
import datetime

In [17]:
pd.Timestamp.mro() # mro = method resolution order

[pandas.tslib.Timestamp,
 pandas.tslib._Timestamp,
 datetime.datetime,
 datetime.date,
 object]

In [18]:
stamp = pd.Timestamp('7/17/2012 10:06:45') #create a timestamp object
stamp

Timestamp('2012-07-17 10:06:45')

In [19]:
stamp.month

7

In [20]:
stamp.year

2012

In [21]:
stamp.value

1342519605000000000L

In [22]:
stamp.strftime('%Y%m%d') #supports formatting

'20120717'

In [23]:
dates = ['2012-07-16', '2012-07-18', '2012-07-20']
dates

['2012-07-16', '2012-07-18', '2012-07-20']

In [24]:
# Convert this to a timeseries index
pd.DatetimeIndex(dates)

<class 'pandas.tseries.index.DatetimeIndex'>
[2012-07-16, ..., 2012-07-20]
Length: 3, Freq: None, Timezone: None

In [25]:
pd.to_datetime(dates) #a little more flexibility, like handling euro dates with dayfirst=True

<class 'pandas.tseries.index.DatetimeIndex'>
[2012-07-16, ..., 2012-07-20]
Length: 3, Freq: None, Timezone: None

In [26]:
ts = Series(range(3), index=pd.to_datetime(dates))
ts.index[0]

Timestamp('2012-07-16 00:00:00')

# Indexing

In [27]:
rng = pd.date_range('2012-07-17', periods=1000) # Create a range of dates
rng

<class 'pandas.tseries.index.DatetimeIndex'>
[2012-07-17, ..., 2015-04-12]
Length: 1000, Freq: D, Timezone: None

In [28]:
ts = Series(np.arange(1000), index=rng) # Create a time-series based on the range above
ts

2012-07-17     0
2012-07-18     1
2012-07-19     2
2012-07-20     3
2012-07-21     4
2012-07-22     5
2012-07-23     6
2012-07-24     7
2012-07-25     8
2012-07-26     9
2012-07-27    10
2012-07-28    11
2012-07-29    12
2012-07-30    13
2012-07-31    14
...
2015-03-29    985
2015-03-30    986
2015-03-31    987
2015-04-01    988
2015-04-02    989
2015-04-03    990
2015-04-04    991
2015-04-05    992
2015-04-06    993
2015-04-07    994
2015-04-08    995
2015-04-09    996
2015-04-10    997
2015-04-11    998
2015-04-12    999
Freq: D, Length: 1000

In [35]:
# Freq D = day
from datetime import datetime

In [36]:
ts[datetime(2012, 11, 27)] # Querying the time series with a datetime object

133

In [38]:
ts['2012-11-27'] # Querying the time series with a string

133

In [42]:
ts[:'2012-8-01'] # Data up to and including 8/1 - end point is inclusive here but in standard python indexes, the end point is not inclusive

2012-07-17     0
2012-07-18     1
2012-07-19     2
2012-07-20     3
2012-07-21     4
2012-07-22     5
2012-07-23     6
2012-07-24     7
2012-07-25     8
2012-07-26     9
2012-07-27    10
2012-07-28    11
2012-07-29    12
2012-07-30    13
2012-07-31    14
2012-08-01    15
Freq: D, dtype: int32

In [44]:
ts['2012-07-20 07:00':'2012-8-01 12:00'] # Works with time stamps that aren't in the series

2012-07-21     4
2012-07-22     5
2012-07-23     6
2012-07-24     7
2012-07-25     8
2012-07-26     9
2012-07-27    10
2012-07-28    11
2012-07-29    12
2012-07-30    13
2012-07-31    14
2012-08-01    15
Freq: D, dtype: int32

In [46]:
ts2 = ts.take(np.random.permutation(len(ts))) # Randomize the time series indexes
ts2.sort_index() # Put them back in order

2012-07-17     0
2012-07-18     1
2012-07-19     2
2012-07-20     3
2012-07-21     4
2012-07-22     5
2012-07-23     6
2012-07-24     7
2012-07-25     8
2012-07-26     9
2012-07-27    10
2012-07-28    11
2012-07-29    12
2012-07-30    13
2012-07-31    14
...
2015-03-29    985
2015-03-30    986
2015-03-31    987
2015-04-01    988
2015-04-02    989
2015-04-03    990
2015-04-04    991
2015-04-05    992
2015-04-06    993
2015-04-07    994
2015-04-08    995
2015-04-09    996
2015-04-10    997
2015-04-11    998
2015-04-12    999
Length: 1000

In [47]:
ts['2012-7'] # you can just enter a month and it will display everything from that month

2012-07-17     0
2012-07-18     1
2012-07-19     2
2012-07-20     3
2012-07-21     4
2012-07-22     5
2012-07-23     6
2012-07-24     7
2012-07-25     8
2012-07-26     9
2012-07-27    10
2012-07-28    11
2012-07-29    12
2012-07-30    13
2012-07-31    14
Freq: D, dtype: int32

In [52]:
df = DataFrame(np.arange(4000).reshape((1000,4)), index=rng, columns=['Colorado', 'Texas', 'New York', 'Ohio'])
df.head() # Create a dataframe with 4000 entries but shaped to be 1000 rows with 4 columns
# arange = a range... creates a range

            Colorado  Texas  New York  Ohio
2012-07-17         0      1         2     3
2012-07-18         4      5         6     7
2012-07-19         8      9        10    11
2012-07-20        12     13        14    15
2012-07-21        16     17        18    19

In [53]:
df.ix['2012-07-20']

Colorado    12
Texas       13
New York    14
Ohio        15
Name: 2012-07-20 00:00:00, dtype: int32

In [54]:
from datetime import timedelta
start = datetime(2012, 12, 31) # Display the entries for 12/31 to 11 days after 12/31
df.ix[start:start + timedelta(days=11)]

            Colorado  Texas  New York  Ohio
2012-12-31       668    669       670   671
2013-01-01       672    673       674   675
2013-01-02       676    677       678   679
2013-01-03       680    681       682   683
2013-01-04       684    685       686   687
2013-01-05       688    689       690   691
2013-01-06       692    693       694   695
2013-01-07       696    697       698   699
2013-01-08       700    701       702   703
2013-01-09       704    705       706   707
2013-01-10       708    709       710   711
2013-01-11       712    713       714   715

# Frequencies